app/controllers/actions_controller.rb

  def index
    @inventory_object = find_inventory_object
    @actions = @inventory_object.actions.all
---
SELECT "actions".* FROM "actions" INNER JOIN "action_inventory_objects" ON "actions".id = "action_inventory_objects".action_id WHERE (("action_inventory_objects".inventory_object_id = 105) AND ("action_inventory_objects".inventory_object_type = E'Computer'))

  def show
    @action = Action.find(params[:id])
---
SELECT * FROM "actions" WHERE ("actions"."id" = 57)

  def destroy
    @action = Action.find(params[:id])
    @action.destroy
---
SELECT * FROM "actions" WHERE ("actions"."id" = 1)
DELETE FROM "actions" WHERE "id" = 1