app/controllers/computers_controller.rb

SELECT * FROM "divisions" WHERE ("divisions"."id" = 1)
SELECT * FROM "computers" WHERE ("computers".division_id = 1)
---
  def index
    if(params[:division_id])
      @division = Division.find(params[:division_id])
      @computers = @division.computers
    else
      @computers = Computer.all

SELECT * FROM "computers" WHERE ("computers"."id" = 104)
---
  def show
    @computer = Computer.find(params[:id])

SELECT * FROM "computers" WHERE ("computers"."id" = 104)
---
  def edit
    @computer = Computer.find(params[:id])

SELECT * FROM "computers" WHERE ("computers"."id" = 116)
DELETE FROM "computers" WHERE "id" = 116
---
  def destroy
    @computer = Computer.find(params[:id])
    @computer.destroy