app/controllers/divisions_controller.rb

SELECT * FROM "divisions"
---
  def index
    @divisions = Division.all

SELECT * FROM "divisions" WHERE ("divisions"."id" = 1)
---
  def show
    @division = Division.find(params[:id])

INSERT INTO "divisions" ("name", "divisions", "created_at", "updated_at") VALUES(E'National and State Services', E'360,420,425,426', '2009-09-14 15:44:57.238739', '2009-09-14 15:44:57.238739') RETURNING "id"
---
  def create
    @division = Division.new(params[:division])

    respond_to do |format|
      if @division.save