app/controllers/main_controller.rb

SELECT * FROM "tabs" WHERE ("tabs".tabset_id = 21) ORDER BY position
UPDATE "tabsets" SET "active_tab_id" = 121, "updated_at" = '2009-08-17 14:02:55.310699' WHERE "id" = 21
---
  def select_tab
    get_tabset;
    @tabset.active_tab=(Tab.find(params[:id]));
    @tabset.save;

SELECT * FROM "tabs" WHERE (tabset_id = 18) ORDER BY position DESC LIMIT 1
DELETE FROM "tabs" WHERE ("id" IN (106))
---
  def close_tab
    tab = Tab.find(params[:id]);
    tab.delete;

SELECT * FROM "computers" WHERE ("computers"."id" = 104)
---
  def change_state_of_system
    begin
      @computer = Computer.find(params[:id])

SELECT * FROM "computers" WHERE ("computers"."id" = 109)
SELECT * FROM "packages" WHERE ("packages"."id" = 3)
SELECT * FROM "bundles" WHERE ("bundles"."id" = 1)
SELECT * FROM "package_maps" WHERE ("package_maps"."package_id" = 3)
---
  def add_licensed_package_or_bundle
    begin
      pkg_or_bundle = params[:pkg_or_bundle].split('_').first
      id = params[:pkg_or_bundle].split('_').last
      @computer = Computer.find(params[:computer_id])
      if pkg_or_bundle == "Package"
        @package = Package.find(id)
        @computer.add_package(@package)
      else
        bundle = Bundle.find(id)
        @computer.add_bundle(bundle)
      end
      @package_maps = PackageMap.find_all_by_package_id(@package.id)

SELECT * FROM "licenses" WHERE ("licenses"."package_id" = E'3') AND ("licenses"."computer_id" = E'1') LIMIT 1
---
  def remove_licensed_package
    lic = License.find_by_computer_id(params[:computer_id], :conditions => { :package_id => params[:package_id] })

SELECT * FROM "package_maps" WHERE ("package_maps"."id" = 9)
SELECT * FROM "computers" WHERE ("computers"."id" = 1)
---
  def trigger_task
    package_map = PackageMap.find(params[:package_map_id])
    task_type = params[:task_type]
    computer = Computer.find(params[:computer_id])

SELECT * FROM "computers" WHERE ("computers"."id" = 104)
SELECT * FROM "peripherals" WHERE ("peripherals".computer_id = 104)
---
  def add_installed_peripheral
    begin
      Computer.find(params[:computer_id]).add_peripheral(Peripheral.find(params[:peripheral_id]))

SELECT * FROM "computers" WHERE ("computers"."id" = 104)
SELECT * FROM "peripherals" WHERE ("peripherals".computer_id = 104)
---
  def remove_installed_peripheral
    Peripheral.find(params[:peripheral_id]).remove_from_computer

SELECT * FROM "computers" WHERE ("computers"."id" = 94)
---
  def open_assigned_licenses
    @computer = Computer.find(params[:id])

SELECT * FROM "computers" WHERE ("computers"."id" = 94)
---
  def close_assigned_licenses
    @computer = Computer.find(params[:id])

SELECT * FROM "computers" WHERE ("computers"."id" = 94)
---
  def open_installed_peripherals
    @computer = Computer.find(params[:id])

SELECT * FROM "computers" WHERE ("computers"."id" = 94)
---
  def close_installed_peripherals
    @computer = Computer.find(params[:id])

SELECT * FROM "computers" WHERE ("computers"."id" = 94)
---
  def open_current_status
     @computer = Computer.find(params[:id])

SELECT * FROM "computers" WHERE ("computers"."id" = 94)
---
  def close_current_status
    @computer = Computer.find(params[:id])