app/controllers/package_maps_controller.rb

  def show
    @package_map = PackageMap.find(params[:id])
---
SELECT * FROM "package_maps" WHERE ("package_maps"."id" = 3)

  def create
    @package_map = PackageMap.new(params[:package_map])
    @package_map.package = @package
    respond_to do |format|
      if @package_map.save
---
INSERT INTO "package_maps" ("remote_package_id", "service_name", "default_install_task", "default_uninstall_task", "created_at", "updated_at", "package_id") VALUES(E'10000107', E'PEROOT Fafnir', E'Install Silently', E'', '2009-09-11 13:51:37.993741', '2009-09-11 13:51:37.993741', NULL) RETURNING "id"

  def destroy
    @package_map = PackageMap.find(params[:id])
    @package_map.destroy
---
SELECT * FROM "package_maps" WHERE ("package_maps"."id" = 1)
DELETE FROM "package_maps" WHERE "id" = 1