app/controllers/packages_controller.rb

SELECT * FROM "packages"
---
  def index
    if(params.key?(:query))
      @packages = Package.search(params[:query], :match_mode => :any)

SELECT * FROM "packages" WHERE ("packages"."id" = 0)
---
  def show
    @package = Package.find(params[:id])

INSERT INTO "packages" ("manufacturer", "name", "version", "created_at", "updated_at") VALUES(E'Allume', E'Stuffit Deluxe', E'12', '2009-09-09 12:59:02.514599', '2009-09-09 12:59:02.514599') RETURNING "id"
---
  def create
    @package = Package.new(params[:package])

    respond_to do |format|
      if @package.save

SELECT * FROM "packages" WHERE ("packages"."id" = 1)
DELETE FROM "packages" WHERE "id" = 1
---
  def destroy
    @package = Package.find(params[:id])
    @package.destroy