app/controllers/peripherals_controller.rb

SELECT * FROM "peripherals"
---
  def index
    if(params[:computer_id])
      @peripherals = Computer.find_by_serial_number(params[:computer_id]).peripherals
    else
      @peripherals = Peripheral.all

SELECT * FROM "peripherals" WHERE ("peripherals"."id" = 47)
---
  def show
    @peripheral = Peripheral.find(params[:id])

INSERT INTO "peripherals" ("computer_id", "serial_number", "po_number", "division", "model", "created_at", "updated_at", "delta") VALUES(NULL, NULL, NULL, NULL, NULL, '2009-08-06 12:31:59.448524', '2009-08-06 12:31:59.448524', 't') RETURNING "id"
---
  def create
    @peripheral = Peripheral.new(params[:peripheral])

    respond_to do |format|
      if @peripheral.save