app/controllers/purchase_orders_controller.rb

SELECT * FROM "divisions" WHERE ("divisions"."id" = 1)
---
  def create
    @purchase_order = PurchaseOrder.new(params[:purchase_order])

    respond_to do |format|
      if @purchase_order.save
        flash[:notice] = 'Purchase Order was successfully created.'
        @division = Division.find(@purchase_order.division_id)

SELECT * FROM "divisions" WHERE ("divisions"."id" = 1)
---
  def edit
    @purchase_order = PurchaseOrder.new()
    @purchase_order.po_number = params[:id]
    @purchase_order.division_id ||= params[:division_id]
    @division = Division.find(@purchase_order.division_id)

SELECT * FROM "computers" WHERE ("computers"."id" = 125)
---
  def edit_computer
    refresh_po_instance(params[:po_number], params[:division_id])
    @computer = Computer.find(params[:id])

SELECT * FROM "computers" WHERE ("computers"."id" = 125)
INSERT INTO "computers" ("name", "mac_address", "domain", "owner", "system_role", "po_number", "model", "stage", "division", "serial_number", "system_class", "last_audited", "created_at", "updated_at", "delta", "location", "site", "last_stage_change", "division_id") VALUES(NULL, NULL, NULL, NULL, NULL, E'83975238', E'D630', E'Storage', NULL, E'kl;djfadf', E'Mac', NULL, '2009-09-15 09:29:13.210693', '2009-09-15 09:29:13.210693', 't', NULL, NULL, '2009-09-15', 1) RETURNING "id"
---
  def save_edited_computer
    refresh_po_instance(params[:po_number], params[:division_id])
    if params.key?(:id)
      @computer = Computer.find(params[:id])
      @computer.edit_with_params(params[:computer])
      flash[:notice] = 'Computer was successfully updated.'
    else
      Computer.create_with_po(@purchase_order, params[:computer])

DELETE FROM "computers" WHERE ("id" IN (123))
SELECT * FROM "computers" WHERE ("computers"."id" = 123)
---
  def delete_computer_from_po
    refresh_po_instance(params[:po_number], params[:division_id])
    Computer.find(params[:id]).delete

SELECT * FROM "peripherals" WHERE ("peripherals"."id" = 48)
---
  def edit_peripheral
    refresh_po_instance(params[:po_number], params[:division_id])
    @periph = Peripheral.find(params[:id])

SELECT * FROM "peripherals" WHERE ("peripherals"."id" = 48)
INSERT INTO "peripherals" ("computer_id", "serial_number", "po_number", "division", "model", "created_at", "updated_at", "delta", "division_id") VALUES(NULL, E'fasdkjldjaf', E'83975238', NULL, E'Monitor', '2009-09-15 09:35:03.556841', '2009-09-15 09:35:03.556841', 't', 1) RETURNING "id"
---
  def save_edited_peripheral
    refresh_po_instance(params[:po_number], params[:division_id])
    if params.key?(:id)
      @periph = Peripheral.find(params[:id])
      @periph.edit_with_params(params[:peripheral])
      flash[:notice] = 'Peripheral was successfully updated.'
    else
      Peripheral.create_with_po(@purchase_order, params[:peripheral])

DELETE FROM "peripherals" WHERE ("id" IN (46))
SELECT * FROM "peripherals" WHERE ("peripherals"."id" = 46)
---
  def delete_peripheral_from_po
    refresh_po_instance(params[:po_number], params[:division_id])
    Peripheral.find(params[:id]).delete

SELECT * FROM "packages" WHERE ("packages"."id" = 1)
INSERT INTO "licenses" ("package_id", "computer_id", "po_number", "notes", "division", "created_at", "updated_at", "license_key", "group_license") VALUES(1, NULL, E'11223344', NULL, E'fvssd', '2009-08-06 14:24:05.008539', '2009-08-06 14:24:05.008539', NULL, 't') RETURNING "id"
---
  def save_new_license
    refresh_po_instance(params[:po_number], params[:division_id])
    pkg = Package.find(params[:package_id])
    quantity = params[:quantity]
    group_license = params[:group_license]

    quantity.to_i.times do |i|
      lic_params = {
        :package_id => pkg.id,
        :group_license => (group_license ? true : false ),
        :group_license => (group_license ? params['license_number'] : params['license_number_' + (i + 1).to_s] )
      }
      License.create_with_po(@purchase_order, lic_params)

SELECT * FROM "licenses" WHERE (package_id = E'1') AND ("licenses"."po_number" = E'11223344')
---
  def delete_license_from_po
    refresh_po_instance(params[:po_number], params[:division_id])
    License.find_all_by_po_number(@purchase_order.po_number, :conditions => ["package_id = ?", params[:id]]).each do |lic|

SELECT * FROM "bundles" WHERE ("bundles"."id" = 1)
SELECT "packages".* FROM "packages" INNER JOIN "bundle_members" ON "packages".id = "bundle_members".package_id WHERE (("bundle_members".bundle_id = 1))
INSERT INTO "licenses" ("package_id", "computer_id", "po_number", "notes", "division", "created_at", "updated_at", "license_key", "group_license") VALUES(2, NULL, E'11223344', NULL, E'fvssd', '2009-08-06 14:32:45.451880', '2009-08-06 14:32:45.451880', NULL, NULL) RETURNING "id"
---
  def save_new_bundle
    refresh_po_instance(params[:po_number], params[:division_id ])
    bundle_to_add = Bundle.find(params[:id])
    quantity = params[:quantity]
    bundle_to_add.packages.each do |pkg|
      quantity.to_i.times do
        lic_params = {
          :package_id => pkg.id,
          :group_license => true
        }
        License.create_with_po(@purchase_order, lic_params)